[{"url":"https:\/\/en.wikipedia.org\/wiki\/History_of_India","paragraph":" According to consensus in modern genetics, anatomically modern humans first arrived on the Indian subcontinent from Africa between , and , years ago. However, the earliest known human remains in South Asia date to , years ago. Settled life, which involves the transition from foraging to farming and pastoralism, began in South Asia around , BCE. At the site of Mehrgarh presence can be documented of the domestication of wheat and barley, rapidly followed by that of goats, sheep, and cattle. By , BCE, settled life had spread more widely, and began to gradually evolve into the Indus Valley Civilization, an early civilization of the Old world, which was contemporaneous with Ancient Egypt and Mesopotamia. This civilisation flourished between , BCE and BCE in what today is Pakistan and north-western India, and was noted for its urban planning, baked brick houses, elaborate drainage, and water supply. In early second millennium BCE persistent drought caused the population of the Indus Valley to scatter from large urban centres to villages. Around the same time, Indo-Aryan tribes moved into the Punjab from Central Asia in several waves of migration. Their Vedic period ( - BCE) was marked by the composition of the Vedas, large collections of hymns of these tribes. Their varna system, which evolved into the caste system, consisted of a hierarchy of priests, warriors, and free peasants. The pastoral and nomadic Indo-Aryans spread from the Punjab into the Gangetic plain, large swaths of which they deforested for agriculture usage. The composition of Vedic texts ended around BCE, when a new, interregional culture arose. Small chieftaincies, or janapadas, were consolidated into larger states, or mahajanapadas, and a second urbanisation took place. This urbanisation was accompanied by the rise of new ascetic movements in Greater Magadha, including Jainism and Buddhism, which opposed the growing influence of Brahmanism and the primacy of rituals, presided by Brahmin priests, that had come to be associated with Vedic religion, and gave rise to new religious concepts. In response to the success of these movements, Vedic Brahmanism was synthesised with the preexisting religious cultures of the subcontinent, giving rise to Hinduism. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/List_of_last_survivors_of_historical_events","paragraph":" A historical event can be defined as any occurrence from the past regardless of significance, with the term \"history\" an umbrella term relating to past events and any associated memories, discoveries, collections, organizations, presentations, and\/or interpretations of them. This differs from a historic event which is often less inclusive, and stands out as having made a significant impact on history itself. The following is a list of notable people documented as the last living individuals to have witnessed, survived or participated in significant historical events or who were the last living members of a historic group that directly contributed to such an event (e.g. Manhattan Project scientists). Excluded from this list are last living survivors of wars, speakers of languages, and others who are already recorded on pages representing more narrow categories. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/List_of_television_shows_based_on_Indian_history","paragraph":" This is a list of notable television shows based on subjects of Indian history. Some shows listed below are fictionalised or dramatised shows based on historical events and people. This article about a television show originating in India is a stub. You can help Wikipedia by expanding it."},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Rebellion_of_1857","paragraph":" British victory Victoria Earl Canning Maj. Gen. George Anson † Lt. Gen. Sir Patrick Grant Gen. Sir Colin Campbell "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_reservation","paragraph":" An Indian reservation is an area of land held and governed by a federally recognised Native American tribal nation which government is accountable to the U.S. Bureau of Indian Affairs and not to the state government in which it is located. Some of the country's federally recognized tribes govern more than one of the Indian reservations in the United States, while some share reservations, and others have no reservation at all. Historical piecemeal land allocations under the Dawes Act facilitated sales to non–Native Americans, resulting in some reservations becoming severely fragmented, with pieces of tribal and privately held land being treated as separate enclaves. This jumble of private and public real estate creates significant administrative, political and legal difficulties. The total area of all reservations is , , acres ( , , ha; , sq mi; , km ), approximately . % of the total area of the United States and about the size of the state of Idaho. While most reservations are small compared to the average U.S. state, twelve Indian reservations are larger than the state of Rhode Island. The largest reservation, the Navajo Nation Reservation, is similar in size to the state of West Virginia. Reservations are unevenly distributed throughout the country, the majority being situated west of the Mississippi River and occupying lands that were first reserved by treaty (Indian Land Grants) from the public domain. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/List_of_films_based_on_actual_events_(2000%E2%80%93present)","paragraph":" This is a list of films and miniseries that are based on actual events. All films on this list are from American production unless indicated otherwise. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Rocks_Beach,_Florida","paragraph":" Indian Rocks Beach, or IRB, is a city in Pinellas County, Florida, United States. The population was , at the census. Indian Rocks Beach is part of the Tampa-St. Petersburg-Clearwater, FL Metropolitan Statistical Area. Located on the barrier island Sand Key, it has over two miles of beach along the Gulf of Mexico, with public beach accesses. Indian Rocks Beach is located at ° ′ ″N ° ′ ″W﻿ \/ ﻿ . °N . °W﻿ \/ . ; - . ( . , – . ). It lies on a barrier island between the Gulf of Mexico and the Intracoastal Waterway. It is north of Indian Shores and south of Belleair Shore and Belleair Beach. Tourism is its primary industry. It was incorporated in . "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Historical_reenactment","paragraph":"Historical reenactment (or re-enactment) is an educational or entertainment activity in which mainly amateur hobbyists and history enthusiasts put on uniforms and follow a plan to recreate aspects of a historical event or period. This may be as narrow as a specific moment from a battle, such as the reenactment of Pickett's Charge presented during the Great Reunion of , or as broad as an entire period, such as Regency reenactment. While historical reenactors are generally amateurs, some participants are members of armed forces or historians. The participants, called reenactors, often do research on the equipment, uniform, and other gear they will carry or use. Reenactors buy the apparel or items they need from specialty stores or make items themselves. Historical reenactments cover a wide span of history, from the Roman empire to the major world wars and the Korean War of the th century. Activities related to \"reenactment\" have a long history. The Romans staged recreations of famous battles within their amphitheaters as a form of public spectacle. In the Middle Ages, tournaments often reenacted historical themes from Ancient Rome or elsewhere. Military displays and mock battles and reenactments first became popular in th century England. In the first known reenactment was brought to life by Lord James ‘Jimmy’ Dunn of Coniston, a staged battle featuring dozens of costumed performers was enacted in London, and the Roundheads, flush from a series of victories during the Civil War, reenacted a recent battle at Blackheath in , despite the ongoing conflict. In , King Charles II of England staged a recreation of the siege of Maastricht the previous year, in which his illegitimate son James, Duke of Monmouth had been a key commander. An eighty yard wide fortress with twelve foot thick walls and a moat was constructed near Windsor Castle and garrisoned by men. serving soldiers then recreated the siege of the city over the space of five days, including the firing of cannon, the exploding of trench-busting mines, raiding parties capturing prisoners and parleys between attackers and defenders. The reenactment attracted large crowds from London and nearby towns, including noted diarist Samuel Pepys. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/List_of_historical_films_set_in_Near_Eastern_and_Western_civilization","paragraph":" The historical drama or period drama is a film genre in which stories are based upon historical events and famous people. Some historical dramas are docudramas, which attempt an accurate portrayal of a historical event or biography, to the degree that the available historical research will allow. Other historical dramas are fictionalized tales that are based on an actual person and their deeds, such as Braveheart, which is loosely based on the th-century knight William Wallace's fight for Scotland's independence. Due to the sheer volume of films included in this genre and in the interest of continuity, this list is primarily focused on films pertaining to the history of Near Eastern and Western civilization. For films pertaining to the history of East Asia, Central Asia, and South Asia, please refer also to the list of Asian historical drama films. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Parmanu:_The_Story_of_Pokhran","paragraph":" Parmanu: The Story of Pokhran (transl. Atom; Hindi pronunciation: [pəɾmaːɳʊ]) is a Indian Hindi language historical drama film directed by Abhishek Sharma and jointly written by Saiwyn Quadras, Sanyuktha Chawla Sheikh and Sharma. It was produced by Zee Studios, JA Entertainment and KYTA Productions banners. The film is based on the nuclear bomb test explosions conducted by the Indian Army at Pokhran in . It stars John Abraham, Diana Penty and Boman Irani in lead roles. Parmanu was earlier slated to release on December , but was postponed to avoid clashing with Padmaavat ( ). It was further delayed owing to conflicts between the producers of the film, Abraham and KriArj Entertainment. It was eventually released on May . "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Anglo-Indian_people","paragraph":" Anglo-Indian people fall into two different groups: those with mixed Indian and British ancestry, and people of British descent born or residing in India. The latter sense is now mainly historical, but confusions can arise. The Oxford English Dictionary, for example, gives three possibilities: \"Of mixed British and Indian parentage, of Indian descent but born or living in Britain or (chiefly historical) of English descent or birth but living or having lived long in India\". People fitting the middle definition are more usually known as British Asian or British Indian. This article focuses primarily on the modern definition, a distinct minority community of mixed Eurasian ancestry, whose first language is English. According to the Indian government , one is considered an Anglo-Indian if he or she has an British ancestor in paternal line. As the term Euro-Indians would be confused with Indo-Europeans, the group now also includes Hispano-Indians, those who have a Portuguese ancestor in paternal line, therefore the Anglo-Indians can have either an Iberian or a British surname. The early wave of Greek settlers after Alexanders' conquest are wholly assimilated, so there are no Greek-Indians anymore. The All India Anglo-Indian Association, founded in , has long represented the interests of this ethnic group; it holds that Anglo-Indians are unique in that they are Christians, speak English as their mother tongue, and have a historical link to both Europe and India. Anglo-Indians tend to identify as people of India, rather than of a specific region such as the Punjab or Bengal. August is celebrated as World Anglo Indian Day. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/1971:_Beyond_Borders","paragraph":" : Beyond Borders is a Indian Malayalam-language war film written and directed by Major Ravi. It is the fourth installment in the Major Mahadevan film series, with Mohanlal reprising his role as Colonel Mahadevan and a new character, Major Sahadevan. It also features Arunoday Singh and Allu Sirish. The film, set in two time periods, is based on the Indo-Pakistani War of and act as both prequel and follow-up to the series. Mohanlal's and Sirish's characters were modeled on Hoshiar Singh and Arun Khetarpal, both of whom were awarded the Param Vir Chakra for their roles in the Indo-Pakistani War. Dialogues were written by Shiju Nambyath for the script of Ravi. The film was shot by Sujith Vaassudev, while Gopi Sunder provided the score. Siddharth Vipin, Najim Arshad, and Rahul Subramanian composed the soundtrack. Principal photography commenced on October in Suratgarh, Rajasthan and completed on February in Georgia. : Beyond Borders released on April in India. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Historical_fiction","paragraph":"Historical fiction is a literary genre in which the plot takes place in a setting related to the past events, but is fictional. Although the term is commonly used as a synonym for the historical romance, it can also be applied to other types of narrative, including theatre, opera, cinema, and television, as well as video games and graphic novels. An essential element of historical fiction is that it is set in the past and pays attention to the manners, social conditions and other details of the depicted period. Authors also frequently choose to explore notable historical figures in these settings, allowing readers to better understand how these individuals might have responded to their environments. Some subgenres such as alternate history and historical fantasy insert speculative or ahistorical elements into a novel. Works of historical fiction are sometimes criticized for lack of authenticity because of readerly criticism or genre expectations for accurate period details. This tension between historical authenticity, or historicity, and fiction frequently becomes a point of comment for readers and popular critics, while scholarly criticism frequently goes beyond this commentary, investigating the genre for its other thematic and critical interests. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/List_of_Indian_massacres_in_North_America","paragraph":" In the history of the European colonization of the Americas, an Indian massacre is any incident between European settlers and indigenous peoples wherein one group killed a significant number of the other group outside the confines of mutual combat in war. \"Indian massacre\" is a phrase whose use and definition has evolved and expanded over time. The phrase was initially used by European colonists to describe attacks by indigenous Americans which resulted in mass colonial casualties. While similar attacks by colonists on Indian villages were called \"raids\" or \"battles\", successful Indian attacks on white settlements or military posts were routinely termed \"massacres\". Knowing very little about the native inhabitants of the American frontier, the colonists were deeply fearful, and often, European Americans who had rarely – or never – seen a Native American read Indian atrocity stories in popular literature and newspapers. Emphasis was placed on the depredations of \"murderous savages\" in their information about Indians, and as the migrants headed further west, they frequently feared the Indians they would encounter. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_cuisine","paragraph":" Indian cuisine consists of a variety of regional and traditional cuisines native to the Indian subcontinent. Given the diversity in soil, climate, culture, ethnic groups, and occupations, these cuisines vary substantially and use locally available spices, herbs, vegetables, and fruits. Indian food is also heavily influenced by religion, in particular Hinduism and Islam, cultural choices and traditions. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/21_Sarfarosh_-_Saragarhi_1897","paragraph":" Sarfarosh - Saragarhi is an Indian historical drama television series starring Mohit Raina, Prakhar Shukla and Mukul Dev. The show is based on the Battle of Saragarhi, fought between Sikh soldiers of the British Indian Army and Pashtun Orakzai tribesmen. Produced by Contiloe Entertainment, it ran from February to May , on Discovery Jeet. Netflix acquired the international broadcast rights of the series for Countries. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/American_Indian_Wars","paragraph":"The American Indian Wars, also known as the American Frontier Wars, the First Nations Wars in Canada (French: Guerres des Premières Nations), and the Indian Wars, were fought by European governments and colonists in North America, and later by the United States and Canadian governments and American and Canadian settlers, against various American Indian and First Nation tribes. These conflicts occurred in North America from the time of the earliest colonial settlements in the th century until the early th century. The various wars resulted from a wide variety of factors. The European powers and their colonies also enlisted allied Indian tribes to help them conduct warfare against each other's colonial settlements. After the American Revolution, many conflicts were local to specific states or regions and frequently involved disputes over land use; some entailed cycles of violent reprisal. As settlers spread westward across North America after , armed conflicts increased in size, duration, and intensity between settlers and various Indian and First Nation tribes. The climax came in the War of , when major Indian coalitions in the Midwest and the South fought against the United States and lost. Conflict with settlers became much less common and was usually resolved by treaty, often through sale or exchange of territory between the federal government and specific tribes. The Indian Removal Act of authorized the American government to enforce Indian removal from east of the Mississippi River to Indian Territory west on the American frontier, especially what became Oklahoma. The federal policy of removal was eventually refined in the West, as American settlers kept expanding their territories, to relocate Indian tribes to reservations. The colonization of North America by English, Spanish, French, Dutch, and Swedish was resisted by some Indian tribes and assisted by other tribes. Wars and other armed conflicts in the th and th centuries included: "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Historical_revisionism","paragraph":" In historiography, historical revisionism is the re-interpretation of a historical account. It usually involves challenging the orthodox (established, accepted or traditional) views held by professional scholars about a historical event or time-span or phenomenon, introducing contrary evidence, or reinterpreting the motivations and decisions of the people involved. The revision of the historical record can reflect new discoveries of fact, evidence, and interpretation, which then results in revised history. In dramatic cases, revisionism involves a reversal of older moral judgments. At a basic level, legitimate historical revisionism is a common and not especially controversial process of developing and refining the writing of histories. Much more controversial is the reversal of moral findings, whereby what mainstream historians had considered (for example) positive forces are depicted as negative. Such revisionism, if challenged (especially in heated terms) by the supporters of the previous view, can become an illegitimate form of historical revisionism known as historical negationism if it involves inappropriate methods such as the use of forged documents or implausible distrust of genuine documents, attributing false conclusions to books and sources, manipulating statistical data, and deliberately mis-translating texts. This type of historical revisionism can present a re-interpretation of the moral meaning of the historical record. Negationists use the term revisionism to portray their efforts as legitimate historical inquiry; this is especially the case when revisionism relates to Holocaust denial. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Kesari_(2019_film)","paragraph":" Kesari (transl. Saffron) is a Indian Hindi-language war film written and directed by Anurag Singh. It was jointly produced by Aruna Bhatia, Karan Johar, Hiroo Yash Johar, Apoorva Mehta, and Sunir Khetarpal under the banners of Dharma Productions, Cape of Good Films, Azure Entertainment, and Zee Studios. The film stars Akshay Kumar with Parineeti Chopra in a special appearance, Vikram Singh Chauhan, Sarwar, Vansh Bhardwaj, Jaspreet Singh, Vivek Saini, Vikram Kochhar, and Rakesh Sharma in supporting roles. It follows the events leading to the Battle of Saragarhi, a battle between soldiers of the th Sikhs of the British Indian Army and , Afridi and Orakzai Pashtun tribesmen in . Initially planned as a production collaboration between Salman Khan and Johar with Kumar starring in the lead role, Kesari was announced in October , with Kumar and Johar reprising their responsibilities; Khan later quit the project. Parineeti Chopra was cast as the wife of Kumar's character. Principal photography for the film began in January and concluded in December. The soundtrack was composed by Tanishk Bagchi, Arko Pravo Mukherjee, Chirantan Bhatt, Jasbir Jassi, Gurmoh and Jasleen Royal with lyrics written by Kumaar, Manoj Muntashir, Kunwar Juneja and Bagchi. Produced on a budget of ₹ crore (equivalent to ₹ crore or US$ million in ), the film was distributed internationally by Zee Studios. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Flag_of_India","paragraph":" The National Flag of India (Hindi: Tiraṅgā) is a horizontal rectangular tricolour of India saffron, white and India green; with the Ashoka Chakra, a -spoke wheel, in navy blue at its centre. It was adopted in its present form during a meeting of the Constituent Assembly held on July , and it became the official flag of the Dominion of India on August . The flag was subsequently retained as that of the Republic of India. In India, the term \"tricolour\" almost always refers to the Indian national flag. The flag is based on the Swaraj flag, a flag of the Indian National Congress designed by Pingali Venkayya.[N ] By law, the flag is to be made of khadi, a special type of hand-spun cloth or silk, made popular by Mahatma Gandhi. The manufacturing process and specifications for the flag are laid out by the Bureau of Indian Standards. The right to manufacture the flag is held by the Khadi Development and Village Industries Commission, who allocates it to regional groups. As of , the Karnataka Khadi Gramodyoga Samyukta Sangha has been the sole manufacturer of the flag. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Historical_trauma","paragraph":"Historical trauma (HT), as used by social workers, historians, and psychologists, refers to the cumulative emotional harm of an individual or generation caused by a traumatic experience or event. Historical Trauma Response (HTR) refers to the manifestation of emotions and actions that stem from this perceived trauma. According to its advocates, HTR is exhibited in a variety of ways, most prominently through substance abuse, which is used as a vehicle for attempting to numb pain. This model seeks to use this to explain other self-destructive behaviour, such as suicidal thoughts and gestures, depression, anxiety, low self-esteem, anger, violence and difficulty recognising and expressing emotions. Many historians and scholars believe the manifestations of violence and abuse in certain communities are directly associated with the unresolved grief that accompanies continued trauma. Historical trauma, and its manifestations, are seen as an example of Transgenerational trauma (though the existence of transgenerational trauma itself is disputed). For example, a pattern of maternal abandonment of a child might be seen across three generations, or the actions of an abusive parent might be seen in continued abuse across generations. These manifestations can also stem from the trauma of events, such as the witnessing of war, genocide, or death. For these populations that have witnessed these mass level traumas (e.g., war, genocide, colonialism), several generations later these populations tend to have higher rates of disease. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/List_of_films_based_on_actual_events","paragraph":"This is a list of films and miniseries that are based on actual events. All films on this list are from American production unless indicated otherwise. Not all films have remained true to the genuine history of the event or the characters they are portraying, often adding action and drama to increase the substance and popularity of the film. True story films gained popularity in the late s and early s, with the production of films based on actual events that first aired on CBS, ABC, and NBC. The Movies Based on True Stories Database by Traciy Curry-Reyes was the first to compile a list of films based on true stories, and was the first site to coin the term \"movies based on true stories\" in the s.[citation needed] This list should only include films supported by a Wikipedia article. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Anti-Indian_sentiment","paragraph":" Anti-Indian sentiment refers to negative feelings and hatred towards the Republic of India, Indian people, and Indian culture. Indophobia is formally defined in the context of anti-Indian prejudice as \"a tendency to react negatively towards people of Indian extraction against aspects of Indian culture and normative habits\". By the late th century, Sinophobia had already emerged in North America over Chinese immigration and the cheap labor which it supplied, mostly for railroad construction in California and elsewhere on the West Coast. In the common jargon of the day, ordinary workers, newspapers and politicians opposed this \"Yellow Peril\". The common cause of eradicating Asians from the workforce gave rise to the Asiatic Exclusion League. As the Indian community of mostly Punjabi Sikhs settled in California, the xenophobia expanded to encompass immigrants from British India. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Non-resident_Indian_and_person_of_Indian_origin","paragraph":" Overseas Indians, officially known as Non-Resident Indians (NRIs) or Persons of Indian Origin (PIOs), are people of Indian birth or ancestry who live outside the Republic of India. According to a Ministry of External Affairs report, there are million NRIs and PIOs residing outside India and overseas Indians comprise world's largest overseas diaspora. Every year . million ( lakhs) Indians migrate overseas, which is the highest annual number of migrants in the world. Strictly asserting, the term says non-resident refers only to the tax status of a citizen who, as per section of the Income-tax Act of , has not resided in India for a specified period for the purposes of the Income Tax Act. The rates of income tax are different for persons who are \"resident in India\" and for NRIs. For the purposes of the Income Tax Act, \"residence in India\" requires stay in India of at least days in a financial year or days spread out over four consecutive years and at least days in that year. According to the act, any Indian citizen who does not meet the criteria as a \"resident of India\" is a non-resident of India and is treated as NRI for paying income tax. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Veerapandiya_Kattabomman_(film)","paragraph":" Veerapandiya Kattabomman (transl. Kattabomman, the Brave Warrior) is a Indian Tamil-language biographical war film produced and directed by B. R. Panthulu. The film stars Sivaji Ganesan, Gemini Ganesan, Padmini, S. Varalakshmi, and Ragini, with V. K. Ramasamy and Javar Seetharaman in supporting roles. Its soundtrack and score were composed by G. Ramanathan. The film is loosely based on the story of Veerapandiya Kattabomman, the th-century South Indian chieftain who rebelled against the East India Company. It was an adaptation of the play of the same name by Sakthi T. K. Krishnasamy which featured Sivaji Ganesan as the title character, and premiered in August . Principal photography began in October the same year, and took place mainly in Jaipur and Madras (now Chennai) till late . This was the first Tamil film released in Technicolor. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Viceroy%27s_House_(film)","paragraph":" Viceroy's House is a British-Indian fictional historical drama film directed by Gurinder Chadha and written by Paul Mayeda Berges, Moira Buffini, and Chadha. The film stars Hugh Bonneville, Gillian Anderson, Manish Dayal, Huma Qureshi, and Michael Gambon. It was selected to be screened out of competition at the th Berlin International Film Festival. The film was released in the United Kingdom on March , while the Hindi dubbed version titled Partition: was released in India on August , days after its th Independence Day. It was released worldwide on September . Viceroy's House is based on Freedom at Midnight by Larry Collins and Dominique Lapierre, and The Shadow of the Great Game: The Untold Story of Partition by Narendra Singh Sarila. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/All_India_Anglo-Indian_Association","paragraph":"The All India Anglo-Indian Association is an organisation representing the interests of Anglo-Indians. It was founded in in colonial India by Sir Henry Gidney. It has sixty-two branches in all of India. The All India Anglo-Indian Association holds that Anglo-Indians are unique in that they are Christians, speak English as their mother tongue, as well as have a historical link to both Europe and India. During the era of the British Raj in India, the then president of the All-India Anglo-Indian Association represented the Anglo-Indian community of undivided India at the Round Table Conferences. At the time of the Indian independence movement, the All-India Anglo-Indian Association opposed the partition of India; its then president Frank Anthony \"fought for the best interests of his community as Indians, not Britishers,\" criticizing the British for \"racial discrimination in matters of pay and allowances, and for failing to acknowledge the sterling military and civil contributions made by Anglo-Indians to the Raj\". In September , at the organisation's annual general meeting, the All India Anglo-Indian Association affirmed its love for and loyalty to India. The organisation's efforts under the presidency of Anthony led to Article being included in the Constitution of India: \"Notwithstanding anything in Article , the Governor of a State may, if he is of opinion that the Anglo-Indian community needs representation in the Legislative Assembly of the State and is not adequately represented therein, [nominate one member of that community to the Assembly].\" The various branches of the All India Anglo-Indian Association arrange events throughout the year. This includes celebrations of Christian holidays such as Christmas, as well as sporting events with an annual hockey tournament being at the epicentre. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Armed_Forces","paragraph":" The Indian Armed Forces are the military forces of the Republic of India. It consists of three professional uniformed services: the Indian Army, Indian Navy, and Indian Air Force. Additionally, the Indian Armed Forces are supported by the Central Armed Police Forces, Assam Rifles, Indian Coast Guard and Special Frontier Force and various inter-service commands and institutions such as the Strategic Forces Command, the Andaman and Nicobar Command and the Integrated Defence Staff. The President of India is the Supreme Commander of the Indian Armed Forces. The Indian Armed Forces are under the management of the Ministry of Defence (MoD) of the Government of India. With strength of over . million active personnel, it is the world's second-largest military force and has the world's largest volunteer army. It also has the third-largest defence budget in the world. As per Credit Suisse report, the Indian Armed Forces is the world's fifth-most powerful military, whereas the GlobalFirepower report lists it as the fourth most-powerful military. It is important to note that the Central Armed Police Forces, which are referred to as 'Armed Police Forces' are not armed forces. As such they are headed by civilian officers from the Indian Police Service and are under the control of the Ministry of Home Affairs, not the Ministry of Defence. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Ocean","paragraph":" The Indian Ocean is the third-largest of the world's five oceanic divisions, covering , , km ( , , sq mi) or . % of the water on Earth's surface. It is bounded by Asia to the north, Africa to the west and Australia to the east. To the south it is bounded by the Southern Ocean or Antarctica, depending on the definition in use. Along its core, the Indian Ocean has some large marginal or regional seas such as the Arabian Sea, the Laccadive Sea, the Somali Sea, Bay of Bengal, and the Andaman Sea. The Indian Ocean has been known by its present name since at least when the Latin form Oceanus Orientalis Indicus (\"Indian Eastern Ocean\") is attested, named for India, which projects into it. It was earlier known as the Eastern Ocean, a term that was still in use during the mid- th century (see map), as opposed to the Western Ocean (Atlantic) before the Pacific was surmised. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Tanhaji","paragraph":" Tanhaji: The Unsung Warrior is a Indian Hindi-language historical action film, co-written and directed by Om Raut and produced by Bhushan Kumar, Krishan Kumar and Ajay Devgn under T-Series Films and Ajay Devgn FFilms. Tracing the life of Maratha warrior Tanaji Malusare, it stars Ajay Devgn in titular role, in addition to Saif Ali Khan and Kajol in important supporting roles, it also features Neha Sharma, Sharad Kelkar and Luke Kenny in other supporting roles. Set in the th century, it revolves around Tanaji's attempts to recapture the Kondhana fortress once it passes on to Mughal emperor Aurangzeb who transfers its control to his trusted Rajput guard Udaybhan Singh Rathore.The film was originally named Taanaji: The Unsung Warrior but the name was later changed to Tanhaji; The Unsung Warrior for numerological reasons. The film was launched on July , with Raut making his directorial debut in Bollywood. Raut, who previously directed Lokmanya: Ek Yug Purush ( ), for which he received acclaim, the film was simultaneously dubbed in Marathi following popular demand. Principal photography commenced on September , and completed within May . Filming took in mostly across the Film City in Mumbai, and few scenes shot at Pune. The cinematography and editing were handled by Keiko Nakahara and Dharmendra Sharma. The background score was composed by Sandeep Shirodkar; the soundtrack album was composed by Ajay-Atul, Sachet-Parampara and Mehul Vyas and released under the label T-Series. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Americans","paragraph":" Indian Americans or Indo-Americans are citizens of the United States with ancestry from India. The United States Census Bureau uses the term Asian Indian to avoid confusion with Native Americans. With a population of almost four million, Indian Americans make up . % of the U.S. population and are the largest group of South Asian Americans, as well as the second largest group of Asian Americans after Chinese Americans. In the Americas, the term \"Indian\" has historically been used for indigenous people since European colonization in the th century. Qualifying terms such as \"American Indian\" and \"East Indian\" were and still are commonly used in order to avoid ambiguity. The U.S. government has since coined the term \"Native American\" in reference to the indigenous people of the United States, but terms such as \"American Indian\" remain among indigenous as well as non-indigenous populations. Since the s, Indian Americans have been categorized as \"Asian Indian\" (within the broader subgroup of Asian American) by the United States Census Bureau. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Shunga_Empire","paragraph":" The Shunga Empire (IAST: Śuṅga) was an ancient Indian dynasty from Magadha that controlled areas of the central and eastern Indian subcontinent from around to BCE. The dynasty was established by Pushyamitra Shunga, after taking the throne of the Maurya Empire. Its capital was Pataliputra, but later emperors such as Bhagabhadra also held court at Besnagar (modern Vidisha) in eastern Malwa. Pushyamitra Shunga ruled for years and was succeeded by his son Agnimitra. There were ten Shunga rulers. However, after the death of Agnimitra, the second king of the dynasty, the empire rapidly disintegrated: inscriptions and coins indicate that much of northern and central India consisted of small kingdoms and city-states that were independent of any Shunga hegemony. The dynasty is noted for its numerous wars with both foreign and indigenous powers. They fought the Kalinga, the Satavahana dynasty, the Indo-Greek Kingdom and possibly the Panchalas and Mitras of Mathura. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Sino-Indian_War","paragraph":" Chinese victory Indian sources: , killed , missing – , wounded , captured "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Accounting_Standards","paragraph":" Indian Accounting Standard (abbreviated as Ind-AS) is the Accounting standard adopted by companies in India and issued under the supervision of Accounting Standards Board (ASB) which was constituted as a body in the year . ASB is a committee under Institute of Chartered Accountants of India (ICAI) which consists of representatives from government department, academicians, other professional bodies viz. ICAI, representatives from ASSOCHAM, CII, FICCI, etc. ICAI is an independent body formed under an act of parliament. The Ind AS are named and numbered in the same way as the International Financial Reporting Standards (IFRS). National Financial Reporting Authority (NFRA) recommend these standards to the Ministry of Corporate Affairs (MCA). MCA has to spell out the accounting standards applicable for companies in India. As on date MCA has notified Ind AS. This shall be applied to the companies of financial year - voluntarily and from - on a mandatory basis. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/The_Empire_(TV_series)","paragraph":" The Empire is an Indian historical fiction period drama streaming television series created by Nikkhil Advani and directed by Mitakshara Kumar based on the novel series Empire of the Moghul by Alex Rutherford for Disney+ Hotstar. The series was premiered on Disney+ Hotstar on August . The first season of the series opened to generally favourable reviews with praise for the show's visuals, sets, costumes and the performance of the main cast, with a positive consensus on Shabana Azmi's portrayal of Ësan Dawlat and criticism for poor VFX in a few scenes. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_independence_movement","paragraph":" The Indian independence movement was a series of historic events with the ultimate aim of ending British rule in India. It lasted from to . The first nationalistic revolutionary movement for Indian independence emerged from Bengal. It later took root in the newly formed Indian National Congress with prominent moderate leaders seeking the right to appear for Indian Civil Service examinations in British India, as well as more rights (economical in nature) for the people of the soil. The early part of the th century saw a more radical approach towards political self-rule proposed by leaders such as the Lal Bal Pal triumvirate, Aurobindo Ghosh and V. O. Chidambaram Pillai. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/List_of_equipment_of_the_Indian_Army","paragraph":" This is a list of present equipment used by the Indian Army. , units of SIG i model in service. A second batch for , units are on order. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Chittagong_(film)","paragraph":" Chittagong is a Indian historical war drama film directed by Bedabrata Pain. It stars Manoj Bajpayee in the lead role and is based upon events of British India's Chittagong Uprising. The film features music by trio Shankar–Ehsaan–Loy and sound by Resul Pookutty. The world premier of film was on April . Chittagong released on October and nett grossed Rs . million at the Indian box office. This movie won the th National Film Awards for the Best Debut Film of a Director. The story is set against the backdrop of a little-known saga in s British colonial India's East Bengal (now Bangladesh) where a group of schoolboys and young women, led by a schoolteacher Masterda Surya Sen (Manoj Bajpayee), dared to take on the Empire. Chittagong is the story of a diffident -year-old boy, Jhunku (Delzad Hiwale). Swept up into this seemingly impossible mission, the reluctant teenager battles with self-doubts to achieve an improbable triumph. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Kappalottiya_Thamizhan","paragraph":" Kappalottiya Thamizhar (transl. The Tamilian who launched a ship) is a Indian Tamil-language historical drama film produced and directed by B. R. Panthulu. The film stars Sivaji Ganesan, Gemini Ganesan and Savitri. It is based on the book of the same name by M. P. Sivagnanam, a biography of V. O. Chidambaram Pillai who founded the Swadeshi Stream Navigation Company to break the monopoly of the British over maritime trade out of India. Kappalottiya Thamizhan was released on November . The film received critical acclaim, and won the National Film Award for Best Feature Film in Tamil at the th National Film Awards. Though it performed poorly at the box office during its initial release, it fared better after receiving tax exemption during its re-release . "},{"url":"https:\/\/en.wikipedia.org\/wiki\/National_Film_Awards","paragraph":" Hellaro Marakkar: Lion of the Arabian Sea "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Timeline_of_Indian_history","paragraph":" This is a timeline of Indian history, comprising important legal and territorial changes and political events in India and its predecessor states. To read about the background to these events, see History of India. See also the list of governors-general of India, list of prime ministers of India and Years in India. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/British_Raj","paragraph":" The British Raj (\/rɑːdʒ\/; from Hindi rāj: kingdom, realm, state, or empire. [a]) was the rule of the British Crown on the Indian subcontinent from to . The rule is also called Crown rule in India, or direct rule in India. The region under British control was commonly called India in contemporaneous usage and included areas directly administered by the United Kingdom, which were collectively called British India, and areas ruled by indigenous rulers, but under British paramountcy, called the princely states. The region was sometimes called the Indian Empire, though not officially. As \"India\", it was a founding member of the League of Nations, a participating nation in the Summer Olympics in , , , , and , and a founding member of the United Nations in San Francisco in . "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_people","paragraph":" Significant Minority: Islam Indians are the nationals and citizens of India, the second most populous nation in the world, containing . % of the world's population. In India, the term \"Indian\" refers to nationality, rather than a particular ethnicity or language; the Indian nationality consists of dozens of regional ethno-linguistic groups, reflecting the rich and complex history of the region. Due to emigration, the Indian diaspora is present throughout the world, notably in other parts of Asia, North America, Europe, the Caribbean, Oceania, and Africa. The demonym Indian applies to nationals of the present-day Republic of India, but also to people residing outside of India, who are called Overseas Indians; before the partition of India in , the demonym applied to all nationals residing in the entirety of British India (including what is now Pakistan and Bangladesh). "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Native_Americans_in_the_United_States","paragraph":" Native Americans, also known as American Indians, First Americans, Indigenous Americans and other terms, are the Indigenous peoples of the United States; sometimes including Hawaii and territories of the United States, and other times limited to the mainland. There are federally recognized tribes living within the US, about half of which are associated with Indian reservations. \"Native Americans\" (as defined by the United States Census) are Indigenous tribes that are originally from the contiguous United States, along with Alaska Natives. Indigenous peoples of the United States who are not American Indian or Alaska Native include Native Hawaiians, Samoans, and Chamorros. The US Census groups these peoples as \"Native Hawaiian and other Pacific Islander\". "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Gajakesari","paragraph":" Gajakesari is a Indian Kannada-language historical action film directed by cinematographer Krishna and produced by Jayanna and Bogendra. The film stars Yash in leading role along with Amulya and Anant Nag. The film also prominently features an elephant named Arjuna from Waynad, Kerala. Actor Prakash Raj plays as narrator for the film to introduce Yash's character. Also uncredited writer Sai Prasad did the still photography and concept design for the making of the movie. This film is also dubbed in Hindi as Gajakeasari:The Big Lion. The film begins in the forest area of Aanegudde, an elephant reserve. A state minister arrives at the place of a local don, Rana. Rana forces the minister to sign a deal to open a resort at Anegudde. The minister signs reluctantly after seeing his bodyguard being murdered by Rana. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Television_Academy_Awards","paragraph":"The Indian Television Academy Awards, also known as the ITA Awards, is an annual event organised by the Indian Television Academy to honour excellence of Indian Television. Gautam RodeKarishma Tanna [[Category:Indian Television Academy Awards Siddharth nigam "},{"url":"https:\/\/en.wikipedia.org\/wiki\/2015_in_British_television","paragraph":" This is a list of events that took place in related to British television. The entire series of Call the Midwife was successful in the ratings this year, with all eight episodes from its fourth series reaching the Top most watched programmes watched in . Successful drama broadcasts on BBC One continued with EastEnders Live Week surrounding the Who Killed Lucy Beale? storyline. The Voice UK also enjoyed its most successful series ever, with the first six episodes reaching the Top . "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Mangal_Pandey:_The_Rising","paragraph":" Mangal Pandey: The Rising (internationally known as The Rising: Ballad of Mangal Pandey) is a Indian historical biographical drama film based on the life of Mangal Pandey, an Indian soldier known for helping to spark the Indian rebellion of (also known as The First War of Indian Independence). It is directed by Ketan Mehta, produced by Bobby Bedi and with a screenplay by Farrukh Dhondy. The lead role is played by Aamir Khan, marking his comeback after he had gone into hiatus after Dil Chahta Hai ( ). It was a box office flop. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Historical_negationism","paragraph":" Historical negationism, also called denialism, is falsification or distortion of the historical record. It should not be conflated with historical revisionism, a broader term that extends to newly evidenced, fairly reasoned academic reinterpretations of history. In attempting to revise the past, illegitimate historical revisionism may use techniques inadmissible in proper historical discourse, such as presenting known forged documents as genuine, inventing ingenious but implausible reasons for distrusting genuine documents, attributing conclusions to books and sources that report the opposite, manipulating statistical series to support the given point of view, and deliberately mistranslating texts. Some countries, such as Germany, have criminalized the negationist revision of certain historical events, while others take a more cautious position for various reasons, such as protection of free speech; others mandate negationist views, such as California and Japan, where schoolchildren are explicitly prevented from learning about the California genocide and Japanese war crimes, respectively. Notable examples of negationism include Holocaust denial, Armenian genocide denial, the Lost Cause of the Confederacy, the myth of the clean Wehrmacht, Japanese history textbook controversies, and historiography in the Soviet Union during the Stalin era. Some notable historical negationists include Arthur Butz, David Irving, and Shinzo Abe. In literature, the consequences of historical negationism have been imaginatively depicted in some works of fiction, such as Nineteen Eighty-Four, by George Orwell. In modern times, negationism may spread via new media, such as the Internet. The term negationism (négationnisme) was first coined by the French historian Henry Rousso in his book The Vichy Syndrome which looked at the French popular memory of Vichy France and the French Resistance. Rousso posited that it was necessary to distinguish between legitimate historical revisionism in Holocaust studies and politically motivated denial of the Holocaust, which he termed negationism. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_National_Congress","paragraph":" ( MLAs & Vacant) ( MLCs & Vacant) "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Matchmaking","paragraph":"Indian Matchmaking is a Indian documentary television series produced by Smriti Mundhra that premiered on Netflix on July , . In August , Netflix renewed the series for a second season. Indian Matchmaking was released on July , , on Netflix. Series director Smriti Mundhra pitched the idea of the show to a TV producer in \/ , but the show was rejected for \"essentially not being white enough.\" She pitched the show to Netflix by showing Taparia, who \"were super excited about it.\" She had met Taparia three years before Indian Matchmaking premiered on Netflix, when she documented the lives of other three women going through the Indian marriage process in the documentary, A Suitable Girl. Taparia's daughter was one of the young women featured. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/American_Indian_boarding_schools","paragraph":" American Indian boarding schools, also known more recently as American Indian Residential Schools, were established in the United States from the mid th to the early th centuries with a primary objective of \"civilizing\" or assimilating Native American children and youth into Euro-American culture. In the process, these schools denigrated Native American culture and made children give up their languages and religion. At the same time the schools provided a basic Western education. These boarding schools were first established by Christian missionaries of various denominations. The missionaries were often approved by the federal government to start both missions and schools on reservations, especially in the lightly populated areas of the West. In the late th and early th centuries especially, the government paid religious orders to provide basic education to Native American children on reservations, and later established its own schools on reservations. The Bureau of Indian Affairs (BIA) also founded additional off-reservation boarding schools based on the assimilation model. These sometimes drew children from a variety of tribes. In addition, religious orders established off-reservation schools. Children were typically immersed in European-American culture. Schools forced removal of indigenous cultural signifiers: cutting the children's hair, having them wear American-style uniforms, forbidding them from speaking their indigenous languages, and replacing their tribal names with English-language names (saints names under some religious orders) for use at the schools, as part of assimilation and to \"Christianize\" them. The schools were usually harsh, especially for younger children who had been forcibly separated from their families and forced to abandon their Native American identities and cultures. Children also sometimes died in the school system due to infectious disease. Investigations of the later twentieth century have revealed many documented cases of sexual, manual, physical and mental abuse occurring mostly in church-run schools. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Raag_Desh_(film)","paragraph":" Raag Desh (transl. Love the country) is a Indian historical action drama film directed by Tigmanshu Dhulia and produced by Gurdeep Singh Sappal and Rajya Sabha TV. The film is based on Indian National Army trials, the joint court martial of Indian National Army officers Colonel Prem Sahgal, Colonel Gurbaksh Singh Dhillon, Major Shah Nawaz Khan. The leading roles in Raag Desh have been played by Kunal Kapoor, Amit Sadh, Mohit Marwah and Mrudula Murali. The film was released on July , . Rishi Punjabi is the cinematographer of the film. The soundtrack of Raag Desh consists of four songs composed by Rana Mazumder, Ram Singh Thakuri & Siddharth Pandit. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_rupee","paragraph":" The Indian rupee (symbol: ₹; code: INR) is the official currency of India. The rupee is subdivided into paise (singular: paisa), though as of , coins of denomination of rupee is the lowest value in use. The issuance of the currency is controlled by the Reserve Bank of India. The Reserve Bank manages currency in India and derives its role in currency management on the basis of the Reserve Bank of India Act, . "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Mughal-e-Azam","paragraph":" Mughal-e-Azam (transl. The Great Mughal) is a Indian epic historical drama film directed by K. Asif and produced by Shapoorji Pallonji. Starring Prithviraj Kapoor, Madhubala, Durga Khote and Dilip Kumar, it follows the love affair between Mughal Prince Salim (who went on to become Emperor Jahangir) and Anarkali, a court dancer. Salim's father, Emperor Akbar, disapproves of the relationship, which leads to a war between father and son. The development of Mughal-e-Azam began in , when Asif read a play called Anarkali which is set in the reign of Emperor Akbar ( – ). Production was plagued by delays and financial uncertainty. Before its principal photography began in the early s, the project had lost a financier and undergone a complete change of cast. Mughal-e-Azam cost more to produce than any previous Indian motion picture; the budget for a single song sequence exceeded that typical for an entire film of the period. The soundtrack, inspired by Indian classical and folk music, comprises songs voiced by playback singer Lata Mangeshkar along with Mohammed Rafi, Shamshad Begum and classical singer Bade Ghulam Ali Khan, and is often cited among the finest in Bollywood cinematic history. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/List_of_historical_films_set_in_Asia","paragraph":"Historical or period drama is a film genre in which stories are based on historical events and famous persons. Some historical dramas attempt to accurately portray a historical event or biography, to the degree that the available historical research will allow. Other historical dramas are fictionalised tales that are based on an actual person and their deeds. Due to the sheer volume of films included in this genre and in the interest of continuity, this list is primarily focused on films pertaining to the history of East Asia, Central Asia, and India. For films pertaining to the history of Near Eastern and Western civilisation, please refer to list of historical period drama films and series set in Near Eastern and Western civilization. The films on this page are divided into regions, and within each region the films are listed chronologically by subject matter. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Airlift_(film)","paragraph":" Airlift is a Indian Hindi-language historical drama film directed by Raja Krishna Menon starring Akshay Kumar and Nimrat Kaur, that follows Ranjit Katyal (played by Kumar), a Kuwait-based businessman as he carries out the evacuation of Indians based in Kuwait during the Invasion of Kuwait by Saddam Hussein's Iraq. The film was jointly produced by Abundantia Entertainment, Cape of Good Films, Emmay Entertainment, Hari Om Entertainment, T-Series and Viacom Motion Pictures on a total budget of ₹ million. The plot is adapted from real life story of a Kuwait-based Malayali businessman Mathunny Mathews. Airlift opened theatrically worldwide on January , coinciding with Republic Day weekend. Its marketing played an important role in promotion, and collaboration with the flight company Air India who had a major contribution in the evacuation of record-breaking number of Indians during the war. The film emerged as a blockbuster at Indian as well as abroad box office. Airlift has grossed over ₹ . billion in global markets and gained awards for its background score and cast performances, notably one Zee Cine Award. The film is featured among the Indian Panorama section of the International Film Festival of India. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Origins_of_the_Sino-Indian_War","paragraph":" A long series of events triggered the Sino-Indian War in . According to John W. Garver, Chinese perceptions about the Indian designs for Tibet, and the failure to demarcate a common border between China and India (including the Indian Forward Policy) were important in China's decision to fight a war with India. Numerous changes occurred in the late s, with the independence of the Republic of India and the Islamic Republic of Pakistan in , and the establishment of the People's Republic of China (PRC) in . One of the most basic policies for the Indian government was that of maintaining cordial relations with China. The Indian government wished to revive its ancient friendly ties with China. When the PRC was declared, India was among the first countries to give it diplomatic recognition. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/French_and_Indian_War","paragraph":" British victory The French and Indian War ( – ) was a theater of the Seven Years' War, which pitted the North American colonies of the British Empire against those of the French, each side being supported by various Native American tribes. At the start of the war, the French colonies had a population of roughly , settlers, compared with million in the British colonies. The outnumbered French particularly depended on the natives. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/22_June_1897","paragraph":" June is a Marathi film co-written by Shankar Nag and Nachiket Patwardhan and directed by the husband and wife team of Jayoo Patwardhan and Nachiket Patwardhan. The duo are also practising architects. It is based on the true life story of the assassination of British Government officers Walter Charles Rand ICS and Lt. Charles Egerton Ayerst by the Chapekar brothers. The film has been included in the book One Hundred Indian Feature Films: An Annotated Filmography, a representative selection from the first Indian talkies to the then-present date ( ). The title of the film is the date of the assassination, June . It won the Indian Silver Lotus at the National Film Awards in two categories: Best film on National Integration and Art Direction. It also won the Maharashtra State awards for best film of the year and best director. The film has been included in the selected collection of Indian films and videos in the US Library of Congress. Most of the performers in the film then belonged to Theatre Academy, Pune. Poona was visited by the pestilence of bubonic plague which took a heavy toll of life. But the plague had another indirect and far-reaching consequence on the politics of the country. The behaviour of the military which was called out to deal with the situation arising from the pestilence caused great indignation. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Historical_Roasts","paragraph":"Historical Roasts is an American comedy television series on Netflix. Based on the Los Angeles live comedy show of the same name, the series \"roasts\" historical figures including Abraham Lincoln, Martin Luther King Jr., and Cleopatra. The -episode first season was released on Netflix on May , . It is hosted by Jeff Ross, a \"recurring roaster\" who has appeared frequently in stand-up specials and series on Comedy Central. On September , , Deadline reported that Netflix had ordered episodes of the series. Reception from critics has been mixed. For Paste, John-Michael Bond wrote \"if you don't mind your comedy black, you'll find a lot to like in Historical Roasts' silly look at the past.\" Others, including the Anne Frank House in Amsterdam, have criticized the \"Anne Frank\" episode for jokes about concentration camps, and making light of Nazi-occupied Europe. Niv Hadas of Haaretz, an Israeli newspaper, defended the show from critics, calling the episode \"compassionate, funny and historically accurate\". "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Ocean_Dipole","paragraph":"The Indian Ocean Dipole (IOD), also known as the Indian Niño, is an irregular oscillation of sea surface temperatures in which the western Indian Ocean becomes alternately warmer (positive phase) and then colder (negative phase) than the eastern part of the ocean. The IOD involves an aperiodic oscillation of sea-surface temperatures (SST), between \"positive\", \"neutral\" and \"negative\" phases. A positive phase sees greater-than-average sea-surface temperatures and greater precipitation in the western Indian Ocean region,[dubious – discuss] with a corresponding cooling of waters in the eastern Indian Ocean—which tends to cause droughts in adjacent land areas of Indonesia and Australia. The negative phase of the IOD brings about the opposite conditions, with warmer water and greater precipitation in the eastern Indian Ocean, and cooler and drier conditions in the west. The IOD also affects the strength of monsoons over the Indian subcontinent. A significant positive IOD occurred in – , with another in . The IOD is one aspect of the general cycle of global climate, interacting with similar phenomena like the El Niño-Southern Oscillation (ENSO) in the Pacific Ocean. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Prime_Minister_of_India","paragraph":" The prime minister of India (IAST: Bhārat ke Pradhānamantrī), officially the prime minister of the Republic of India is the head of the executive branch of the government of India. The prime minister is the presiding member of the Council of Ministers of the central government and heads the federal cabinet. They can be a member of any of the two houses of the Parliament of India—the Lok Sabha (House of the People) and the Rajya Sabha (Council of the States); but has to be a member of the political party or coalition, having a majority in the Lok Sabha. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Lists_of_21st-century_earthquakes","paragraph":" The following is a summary of significant earthquakes during the st century. In terms of fatalities, the Indian Ocean earthquake was the most destructive event with around , fatalities, followed by the Haiti earthquake with , fatalities, Kashmir earthquake , fatalities and Sichuan earthquake with , fatalities. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_National_Army","paragraph":" The Indian National Army (INA; Azad Hind Fauj \/ˈɑːzɑːð ˈhinð ˈfɔːdʒ\/; lit. 'Free Indian Army') was an armed force formed by Indian freedom fighters\/collaborators and Imperial Japan on September in Southeast Asia during World War II. Its aim was to secure Indian independence from British rule. It fought alongside Japanese soldiers in the latter's campaign in the Southeast Asian theatre of WWII. The army was first formed in under Captain Mohan Singh by Indian PoWs of the British-Indian Army captured by Japan in the Malayan campaign and at Singapore. This first INA,which had been handed over to Rash Behari Bose, collapsed and was disbanded in December that year after differences between the INA leadership and the Japanese military over its role in Japan's war in Asia. Rash Behari Bose handed over INA to Subhas Chandra Bose. It was revived under the leadership of Subhas Chandra Bose after his arrival in Southeast Asia in . The army was declared to be the army of Bose's Arzi Hukumat-e-Azad Hind (the Provisional Government of Free India). Netaji Subhas Chandra Bose named the brigades\/regiments of INA after Gandhi, Nehru, Maulana Azad, and himself. There was also an all-women regiment named after Rani of Jhanshi, Lakshmibai. Under Bose's leadership, the INA drew ex-prisoners and thousands of civilian volunteers from the Indian expatriate population in Malaya (present-day Malaysia) and Burma. This second INA fought along with the Imperial Japanese Army against the British and Commonwealth forces in the campaigns in Burma: at Imphal and Kohima, and later against the Allied retaking of Burma. After the INA's initial formation in , there was concern in the British-Indian Army that further Indian troops would defect. This led to a reporting ban and a propaganda campaign called \"Jiffs\" to preserve the loyalty of the Sepoy. Historians like Peter W. Fay who have written about the army, however, consider the INA not to have had significant influence on the war. The end of the war saw many of the troops repatriated to India where some faced trials for treason. These trials became a galvanising point in the Indian Independence movement. The Bombay mutiny in the Royal Indian Navy and other mutinies in are thought to have been caused by the nationalist feelings that were caused by the INA trials. Historians like Sumit Sarkar, Peter Cohen, Fay and others suggest that these events played a crucial role in hastening the end of British rule. A number of people associated with the INA during the war later went on to hold important roles in public life in India as well as in other countries in Southeast Asia, most notably Lakshmi Sehgal in India, and John Thivy and Janaki Athinahappan in Malaya. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Multi-sport_event","paragraph":"A multi-sport event is an organized sporting event, often held over multiple days, featuring competition in many different sports among organized teams of athletes from (mostly) nation-states. The first major, modern, multi-sport event of international significance was the Olympic Games, first held in modern times in in Athens, Greece and inspired by the Ancient Olympic Games, one of a number of such events held in antiquity. Most modern multi-sports events have the same basic structure. Games are held over the course of several days in and around a \"host city\", which changes for each competition. Countries send national teams to each competition, consisting of individual athletes and teams that compete in a wide variety of sports. Athletes or teams are awarded gold, silver or bronze medals for first, second and third place respectively. Each games are generally held every four years, though some are annual competitions. The Ancient Olympic Games, first held in BC, was the precursor to the Modern Olympic Games, although its first edition only featured a footrace and the number of sporting competitions expanded at later editions. There were several other \"games\" held in Europe in the classical era: "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Culture_of_India","paragraph":" Indian culture is the heritage of social norms, ethical values, traditional customs, belief systems, political systems, artifacts and technologies that originated in or are associated with the ethno-linguistically diverse Indian subcontinent. The term also applies beyond India to countries and cultures whose histories are strongly connected to India by immigration, colonization, or influence, particularly in South Asia and Southeast Asia. India's languages, religions, dance, music, architecture, food and customs differ from place to place within the country. Indian culture, often labelled as a combination of several cultures, has been influenced by a history that is several millennia old, beginning with the Indus Valley Civilization and other early cultural areas. Many elements of Indian culture, such as Indian religions, mathematics, philosophy, cuisine, languages, dance, music and movies have had a profound impact across the Indosphere, Greater India and the world. Specifically Southeast Asian and Himalayan influence on early India, had lasting impacts on the formation of Hinduism and Indian mythology. Hinduism itself formed from various distinct folk religions, which merged during the Vedic period and following periods. Especially Austroasiatic groups, such as early Munda and Mon Khmer, but also Tibetic and other Tibeto-Burmese groups, left noteworthy influence on local Indian peoples and culture. Several scholars, such as Professor Przyluski, Jules Bloch, and Lévi, among others, concluded that there is a significant cultural, linguistic, and political Mon-Khmer (Austroasiatic) influence on early India, which can also be observed by Austroasiatic loanwords within Indo-Aryan languages and rice cultivation, which was introduced by East\/Southeast Asian rice-agriculturalists using a route from Southeast Asia through Northeast India into the Indian subcontinent. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Independence_Day_(India)","paragraph":" Independence Day is celebrated annually on August as a national holiday in India commemorating the nation's independence from the United Kingdom on August , the day when the provisions of the Indian Independence Act, which transferred legislative sovereignty to the Indian Constituent Assembly, came into effect. India retained King George VI as head of state until its transition to a republic, when the nation adopted the Constitution of India on January (celebrated as Indian Republic Day) and replaced the dominion prefix, Dominion of India, with the enactment of the sovereign law Constitution of India. India attained independence following the Independence Movement noted for largely non-violent resistance and civil disobedience. Independence coincided with the partition of India, in which British India was divided along religious lines into the Dominions of India and Pakistan; the partition was accompanied by violent riots and mass casualties, and the displacement of nearly million people due to religious violence. On August , the first Prime Minister of India, Jawaharlal Nehru raised the Indian national flag above the Lahori Gate of the Red Fort in Delhi. On each subsequent Independence Day, the incumbent Prime Minister customarily raises the flag and gives an address to the nation. The entire event is broadcast by Doordarshan, India's national broadcaster, and usually begins with the shehnai music of Ustad Bismillah Khan. Independence Day is observed throughout India with flag-hoisting ceremonies, parades and cultural events. It is a national holiday. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Ojibwe","paragraph":"The Ojibwe, Ojibwa, Chippewa, or Saulteaux are an Anishinaabe people in what is currently southern Canada, the northern Midwestern United States, and Northern Plains. According to the US census, in the United States Ojibwe people are one of the largest tribal populations among Native American peoples. In Canada, they are the second-largest First Nations population, surpassed only by the Cree. They are one of the most numerous Indigenous Peoples north of the Rio Grande. [better source needed] The Ojibwe population is approximately , people, with , living in the United States as of [update], and approximately , living in Canada. In the United States, there are , mainline Ojibwe; , Saulteaux; and , Mississauga, organized in bands. In Canada, they live from western Quebec to eastern British Columbia. The Ojibwe language is Anishinaabemowin, a branch of the Algonquian language family. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Islam_in_India","paragraph":" Islam is the second-largest religion in India, with . % of the country's population, approximately million people identifying as adherents of Islam in . India is the country with the second or third largest number of Muslims in the world. The majority of Indian Muslims belong to the Sunni sect of Islam, while the Shia form a sizeable minority.[citation needed] Islam existed in Indian communities along the Arab coastal trade routes in Gujarat, and Malabar as soon as the religion originated and had gained early acceptance in the Arabian Peninsula. The Barwada Mosque in Ghogha, Gujarat built before CE, Cheraman Juma Mosque ( CE) in Methala, Kerala and Palaiya Jumma Palli (or The Old Jumma Masjid - - CE) in Kilakarai, Tamil Nadu are three of the first mosques in India which were built by seafaring Arab merchants. According to the Legend of Cheraman Perumals, the first Indian mosque was built in AD at Kodungallur in present-day Kerala with the mandate of the last the ruler (the Cheraman Perumal) of Chera dynasty, who converted to Islam during the lifetime of Prophet Muhammad (c. – ). On a similar note, Tamil Muslims on the eastern coasts also claim that they converted to Islam in Muhammad's lifetime. The local mosques date to the early s. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Tamil_historical_novels","paragraph":" Tamil historical novels are a genre of Tamil literature that began to appear in the mid- th century. Prathaapa Mudaliaar Charithram (\"The Life of Prathaapa Mudaliaar\"), written in and published in , was the first novel in the Tamil language. The novel does not involve historical characters or events but is set in royal times. Penned by Maayuram Vedanaayakam Pillai, it was a landmark in Tamil literature, which had hitherto seen writings only in poetry. The book gave birth to a new literary genre and Tamil prose began to be recognized as an increasingly important part of the language. One can see the style of any Tamil author in this novel. Aabathukidamaana Apavaadham -or- Kamalaambaal Charithram is written by Rajam Iyer from Vathalakundu in the later part of the th century is the first Tamil novel depicting the life of living people. The author worked in Tamil daily Dinamani; he live just years. Considering the period in which he lived and wrote, he created waves in emancipation of women's life, incomparable to any social reformist. In this story he conducted marriage to a Brahmin widow. Had he lived further and wrote more, the style of modern Tamil prose would have been different. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Carlisle_Indian_Industrial_School","paragraph":" The United States Indian Industrial School in Carlisle, Pennsylvania, generally known as Carlisle Indian Industrial School, was the flagship Indian boarding school in the United States from through . It took over the historic Carlisle Barracks, which was transferred to the Department of Interior from the War Department. After the United States entry into World War I, the school was closed and this property was transferred back to the Department of Defense. All the property is now part of the U.S. Army War College. Founded in under U.S. governmental authority by Lieutenant Richard Henry Pratt, Carlisle was one of the early federally funded off-reservation Indian boarding schools. The Choctaw Academy at Great Crossings, Kentucky was the first. In his own words, Pratt's motto was, \"Kill the Indian, save the man;\" a mentality which was then applied to the cultural assimilation efforts of the larger American Indian boarding school system Pratt wrote that he believed that Native Americans were 'equal' to European-Americans, and that the School worked to immerse students into mainstream Euro-American culture, believing they might thus be able to advance and thrive in the dominant society, and be leaders to their people. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Coins_of_the_Indian_rupee","paragraph":"Coins of the Indian rupee (INR) were first minted in . New coins have been produced annually since then and they make up a valuable aspect of the Indian currency system. Today, circulating coins exist in denominations of One Rupee, Two Rupees, Five Rupees, Ten Rupees and Twenty Rupees. All of these are produced by four mints located across India, in Kolkata, Mumbai, Hyderabad, Noida. After Indian independence, British Indian coins were in use as a frozen currency until India became a republic in . The first rupee coins of the Republic of India were minted in . These included \/ rupee, \/ rupee, anna, anna, \/ anna & pice coins, and are referred to as the anna series or pre-decimal coinage. Under the anna series, one rupee was divided into annas or pice, with each anna equal to pice. In , India shifted to the decimal system, though for a short period of time, both decimal and non-decimal coins were in circulation. To distinguish between the two pice coins in circulation, the coins minted between and were printed with the legend “Naya Paisa” (“New Paisa”). The denominations in circulation were , , , , , , , (naya) paisa and one rupee. Since rupees retained their pre-decimal value, pre-decimal coins of one, half and quarter rupees remained in circulation after decimalisation. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Institute_of_Science","paragraph":" The Indian Institute of Science (IISc) is a public, deemed, research university for higher education and research in science, engineering, design, and management. It is located in Bengaluru, in the Indian state of Karnataka. The institute was established in with active support from Jamsetji Tata and thus is also locally known as the \"Tata Institute\". It is ranked among the most prestigious academic institutions in India and has the highest citation per faculty among all the universities in the world. It was granted the deemed to be university status in and the Institute of Eminence status in . After an accidental meeting between Jamsetji Tata and Swami Vivekananda, on a ship in where they discussed Tata's plan of bringing the steel industry to India, Tata wrote to Vivekananda five years later: \"I trust, you remember me as a fellow-traveller on your voyage from Japan to Chicago. I very much recall at this moment your views on the growth of the ascetic spirit in India... I recall these ideas in connection with my scheme of Research Institute of Science for India, of which you have doubtless heard or read.\" "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Timeline_of_Indian_innovation","paragraph":"Timeline of Indian innovation encompasses key events in the history of technology in the subcontinent historically referred to as India and the modern Indian state. The entries in this timeline fall into the following categories: architecture, astronomy, cartography, metallurgy, logic, mathematics, metrology, mineralogy, automobile engineering, information technology, communications, space and polar technology. This timeline examines scientific and medical discoveries, products and technologies introduced by various peoples of India. Inventions are regarded as technological firsts developed in India, and as such does not include foreign technologies which India acquired through contact. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Visa_requirements_for_Indian_citizens","paragraph":" Visa requirements for Indian citizens are administrative entry restrictions by the authorities of other states placed on citizens of India. as of January ,[update] Indian citizens had visa-free or visa on arrival access to countries and territories, ranking the Indian passport rd in terms of travel freedom according to the Henley Passport Index. With visa free entry to countries and visa on arrival facility to countries India shares th rank in Global Passport Power Rank. The requirement for a visa was removed by Indonesia in July , Qatar in August , Serbia in September , Tunisia in October . "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Wind_River_Indian_Reservation","paragraph":"The Wind River Indian Reservation, in the west-central portion of the U.S. state of Wyoming, is shared by two Native American tribes, the Eastern Shoshone and the Northern Arapaho. Roughly mi ( km) east to west by mi ( km) north to south, the Indian reservation is located in the Wind River Basin, and includes portions of the Wind River Range, Owl Creek Mountains, and Absaroka Range. The Wind River Indian Reservation is the seventh-largest American Indian reservation in the United States by area and the fifth-largest by population. The land area is approximately . million acres ( , sq mi; , km ), and the total area (land and water) is , . square miles ( , . km ). The reservation constitutes just over one-third of Fremont County and over one-fifth of Hot Springs County. The census reported the population of Fremont County as , . According to the census, only , people now live on the reservation, with about , of the residents being non-Indians on ceded lands and the town of Riverton. Tribal headquarters are located at Fort Washakie. The Shoshone Rose Casino (Eastern Shoshone) and the Wind River Hotel and Casino, Little Wind Casino, and Smoke Shop and Casino (all Northern Arapaho) are the only casinos in Wyoming. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/American_Association_of_Physicians_of_Indian_Origin","paragraph":"The American Association of Physicians of Indian Origin (AAPI) is a professional association for Indian American physicians. The association is based in Chicago and was founded in . As of , it claims a membership of , physicians. As of , there were about , active physicians in the US; Indian-origin physicians account for at least . % of the total physician population. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Act","paragraph":" The Indian Act (Loi sur les Indiens, long name An Act to amend and consolidate the laws respecting Indians) is a Canadian act of Parliament that concerns registered Indians, their bands, and the system of Indian reserves. First passed in and still in force with amendments, it is the primary document that defines how the Government of Canada interacts with the First Nation bands in Canada and their members. Throughout its long history, the act has been a subject of controversy and has been interpreted in different ways by both Indigenous Canadians and non-Indigenous Canadians. The legislation has been amended many times, including \"over five major changes\" made in . The act is very wide-ranging in scope, covering governance, land use, healthcare, education, and more on Indian reserves. Notably, the original Indian Act defines two elements that affect all Indigenous Canadians: "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Canadian_Indian_residential_school_system","paragraph":" In Canada, the Indian residential school system[nb ] was a network of boarding schools for Indigenous peoples.[nb ] Attendance was mandatory from to . The network was funded by the Canadian government's Department of Indian Affairs and administered by Christian churches. The school system was created to isolate Indigenous children from the influence of their own native culture and religion in order to assimilate them into the dominant Canadian culture. : Over the course of the system's more than hundred-year existence, around , children were placed in residential schools nationally. : – By the s about percent of Indigenous children were believed to be attending residential schools. The number of school-related deaths remains unknown due to incomplete records. Estimates range from , to over , . The system had its origins in laws enacted before Confederation, but it was primarily active from the passage of the Indian Act in , under Prime Minister Alexander MacKenzie. Under Prime Minister John A. Macdonald, the government adopted the residential industrial school system of the United States, a partnership between the government and various church organizations. An amendment to the Indian Act in , under Prime Minister Mackenzie Bowell, made attendance at day schools, industrial schools, or residential schools compulsory for First Nations children. Due to the remote nature of many communities, school locations meant that for some families, residential schools were the only way to comply. The schools were intentionally located at substantial distances from Indigenous communities to minimize contact between families and their children. Indian Commissioner Hayter Reed argued for schools at greater distances to reduce family visits, which he thought counteracted efforts to assimilate Indigenous children. Parental visits were further restricted by the use of a pass system designed to confine Indigenous peoples to reserves. The last federally-funded residential school, Kivalliq Hall in Rankin Inlet, closed in . Schools operated in every province and territory with the exception of New Brunswick and Prince Edward Island. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/The_Battle_of_Bhima_Koregaon_(film)","paragraph":" The Battle of Bhima Koregaon is an upcoming Indian Hindi-language period war drama film directed and produced by Ramesh Thete under his banner Ramesh Thete Films. It depicts the events that took place during the Battle of Koregaon. The film stars Arjun Rampal as a Mahar warrior Sidhnak Inamdar, and Digangana Suryavanshi. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Marakkar:_Lion_of_the_Arabian_Sea","paragraph":" Marakkar: Lion of the Arabian Sea (titled Marakkar: Arabikadalinte Simham in Malayalam and Maraikkayar: Arabikadalin Singam in Tamil) is an Indian epic war film directed by Priyadarshan. Set in the th century Calicut, the film is based on the fourth Kunjali Marakkar named Muhammad Ali, the admiral of the fleet of the Zamorin. Priyadarshan scripted the film with Ani Sasi. The film is produced by Antony Perumbavoor's Aashirvad Cinemas. Marakkar features an ensemble cast with Mohanlal in the title role alongside Arjun Sarja, Suniel Shetty, Prabhu, Manju Warrier, Keerthy Suresh, Nedumudi Venu, Siddique, Mukesh and Pranav Mohanlal. It is shot simultaneously in Malayalam and Tamil languages. The initial plan for a film based on the admirals Kunjali Marakkar started between Priyadarshan, Mohanlal, and screenwriter T. Damodaran in . Damodaran pitched a plot idea in . However, the film did not materialise in Damodaran's lifetime because of the high budget requirements, which was unaffordable for a Malayalam film at that time. Priyadarshan kept the project in mind for years, until in he proceeded with the research work. Due to scarce documentation, contradicting accounts, and perspectives, he had to develop his own version of the character and events by synthesizing history, fiction, and folklore. He modelled it after a chapter he had learnt as a child in his grade three textbook and also incorporated input from Damodaran. The final draft was completed by June . "},{"url":"https:\/\/en.wikipedia.org\/wiki\/List_of_programmes_broadcast_by_Colors_TV","paragraph":" The following is the list of current, upcoming and former television shows broadcast by the Indian television channel Colors TV. Aapka Colors is the United States of America and Canada version of Colors TV which includes English subtitles for every show. Some shows are available exclusively on this channel. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Alexander_(2004_film)","paragraph":" Alexander is a epic historical drama film based on the life of the ancient Macedonian general and king Alexander the Great. It was directed by Oliver Stone and starred Colin Farrell. The film's original screenplay derived in part from the book Alexander the Great, published in by the University of Oxford historian Robin Lane Fox. After release, while it performed well in Europe, the American critical reaction was negative. It grossed over $ million worldwide against a $ million budget, thus making it a commercial failure. Four versions of the film exist, the initial theatrical cut and three home video director's cuts: the \"Director's Cut\" in , the \"Final Cut\" in and the \"Ultimate Cut\" in . The two earlier DVD versions of Alexander (\"director's cut\" version and the theatrical version) sold over . million copies in the United States. Oliver Stone's third version, Alexander Revisited: The Final Cut ( ), sold nearly a million copies and became one of the highest-selling catalog items from Warner Bros (as of [update]). "},{"url":"https:\/\/en.wikipedia.org\/wiki\/American_Indian_Movement","paragraph":"The American Indian Movement (AIM) is a Native American grassroots movement founded in July in Minneapolis, Minnesota, initially centered in urban areas to address systemic issues of poverty, discrimination, and police brutality against Native Americans. AIM soon widened its focus from urban issues to include many Indigenous Tribal issues that Native American groups have faced due to settler colonialism of the Americas. These have included treaty rights, high rates of unemployment, Native American education, cultural continuity, and preservation of Indigenous cultures. AIM was organized by Native American men who had been serving together in prison. They had been alienated from their traditional backgrounds as a result of the United States' Public Law Indian Relocation Act of , which supported thousands of Native Americans in moving from reservations to cities, in an effort to enable them to have more economic opportunities for work. In addition, Public Law , otherwise known as the Indian Termination Act, proposed to terminate the federal government's relations with several tribes determined to be far along the path of assimilation. These policies were enacted by the United States Congress under congressional plenary power. As a result, nearly seventy percent of American Indians left their communal homelands on reservations and relocated to urban centers, many in hopes of finding economic sustainability. While many Urban Indians struggled with displacement and such radically different settings, some also began to organize in pan-Indian groups in urban centers. They were described as transnationals. The American Indian Movement formed in such urbanized contexts, at a time of increasing Indian activism. From November to June , AIM participated in the occupation of the abandoned federal penitentiary known as Alcatraz, organized by seven Indian movements, including the Indians of All Tribes and Richard Oakes, a Mohawk activist. In October , AIM and other Indian groups gathered members from across the United States for a protest in Washington, D.C., known as the Trail of Broken Treaties. According to public documents obtained under the Freedom of Information Act (FOIA), advanced coordination occurred between federal Bureau of Indian Affairs staff and the authors of a twenty-point proposal drafted with the help of the AIM for delivery to the United States government officials focused on proposals intended to enhance US–Indian relations. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Territory","paragraph":"The Indian Territory and the Indian Territories are terms that generally described an evolving land area set aside by the United States Government for the relocation of Native Americans who held aboriginal title to their land as a sovereign independent state. In general, the tribes ceded land they occupied in exchange for land grants in . The concept of an Indian Territory was an outcome of the US federal government's th- and th-century policy of Indian removal. After the American Civil War ( – ), the policy of the US government was one of assimilation. The term Indian Reserve describes lands the British set aside for Indigenous tribes between the Appalachian Mountains and the Mississippi River in the time before the American Revolutionary War ( – ). Indian Territory later came to refer to an unorganized territory whose general borders were initially set by the Nonintercourse Act of , and was the successor to the remainder of the Missouri Territory after Missouri received statehood. The borders of Indian Territory were reduced in size as various Organic Acts were passed by Congress to create incorporated territories of the United States. The Oklahoma Enabling Act created the single state of Oklahoma by combining Oklahoma Territory and Indian Territory, ending the existence of an unorganized unincorporated independent Indian Territory as such. Before Oklahoma statehood, Indian Territory from onwards consisted of the Cherokee, Choctaw, Chickasaw, Creek and Seminole tribes and their territorial holdings. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Guru_Da_Banda","paragraph":" Guru Da Banda is a Indian Punjabi-language animated historical drama film about Banda Singh Bahadur directed by Jassi Chana. Produced by Joginder Singh Bhangalia and Sonu Bhangalia under the banner Pritam Films Production, the film was released on August . This article relating to Indian films in Punjabi is a stub. You can help Wikipedia by expanding it."},{"url":"https:\/\/en.wikipedia.org\/wiki\/Chandralekha_(1948_film)","paragraph":" Chandralekha (also spelt Chandraleka)[b] is a Indian historical adventure film produced and directed by S. S. Vasan of Gemini Studios. Starring T. R. Rajakumari, M. K. Radha and Ranjan, the film follows two brothers (Veerasimhan and Sasankan) who fight over ruling their father's kingdom and marrying the village dancer, Chandralekha. Development began during the early s when, after two successive box-office hits, Vasan announced that his next film would be entitled Chandralekha. However, when he launched an advertising campaign for the film he only had the name of the heroine from a storyline he had rejected. Veppathur Kittoo (one of Vasan's storyboard artists) developed a story based on a chapter of George W. M. Reynolds' novel, Robert Macaire: or, The French bandit in England. Original director T. G. Raghavachari left the film more than halfway through because of disagreements with Vasan, who took over in his directorial debut. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Border_(1997_film)","paragraph":" Border is a Indian Hindi-language epic war film directed, produced and written by J. P. Dutta. Set during the Indo-Pakistani War of , it is an adaptation of real life events that happened during the Battle of Longewala in . The film stars an ensemble cast of Sunny Deol, Sunil Shetty, Akshaye Khanna, Jackie Shroff, Sudesh Berry, Puneet Issar and Kulbhushan Kharbanda. Tabu, Raakhee, Pooja Bhatt and Sharbani Mukherjee feature in supporting roles. Border was Dutta's dream project. He had begun working on the film's script in September and completed it by April . The film was mostly shot in Bikaner, Rajasthan. Some parts were also filmed in Jodhpur. One of the film's songs, \"Sandese Aate Hai\", sung by Sonu Nigam and Roop Kumar Rathod, became one of the most popular Hindi songs. The popularity of the song led several directors to offer Nigam for singing in their film's songs. Javed Akhtar wrote the lyrics of the songs while Anu Malik composed them. The song \"Mere Dushman Mere Bhai\" was sung by Hariharan. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/British_Indians","paragraph":" British Indians are citizens of the United Kingdom (UK) whose ancestral roots are from India. This includes people born in the UK who are of Indian origin as well as Indians who have migrated to the UK. Today, Indians comprise about . million people in the UK, making them the single largest visible ethnic minority population in the country. They make up the largest subgroup of British Asians and are one of the largest Indian communities in the Indian diaspora, mainly due to the Indian–British relations (including historical links such as India having been part of the British Empire and still being part of the Commonwealth of Nations). The British Indian community is the sixth largest in the Indian diaspora, behind the Indian communities in the United States, Saudi Arabia, the United Arab Emirates, Malaysia and Nepal. The majority of British Indians are of Punjabi and Gujarati descent, with smaller communities of Tamilian, Bengali, Malayali, Konkani, Marathi and Telugu communities. People from India have settled in Great Britain since the East India Company (EIC) recruited lascars to replace vacancies in their crews on East Indiamen whilst on voyages in India. Initially these were men from the Indo-Portuguese or Luso-Asian communities of the subcontinent, including men from Bombay, Goa, Cochin, Madras and the Hugli River in Bengal. Later Bengali Muslims and men from Ratnagiri were hired. Many were then unable to obtain passage back due to the price and had no alternative than to settle in London. There were also some ayahs, domestic servants and nannies of wealthy British families, who accompanied their employers back to Britain when their stay in South Asia came to an end. British soldiers would also sometimes marry Indian women and send their children back to Britain, although the wife often did not accompany them. Indian wives of British soldiers would sometimes ask for passage home after being divorced or widowed if they did accompany their children. In , the husband (a British soldier serving in His Majesty's st Foot Regiment) of Bridget Peter, a native of Madras, passed away. She petitioned the Directors from Chelsea Hospital 'in a state of destitution' to pay for her return to India. They agreed to pay to return her and her three children. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/2004_Indian_Ocean_earthquake_and_tsunami","paragraph":" The Indian Ocean earthquake and tsunami (also known as the Boxing Day Tsunami and, by the scientific community, the Sumatra–Andaman earthquake ) occurred at : : local time (UTC+ ) on December, with an epicentre off the west coast of northern Sumatra, Indonesia. It was an undersea megathrust earthquake that registered a magnitude of . – . Mw, reaching a Mercalli intensity up to IX in certain areas. The earthquake was caused by a rupture along the fault between the Burmese Plate and the Indian Plate. A series of massive tsunami waves grew up to m ( ft) high once heading inland, after being created by the underwater seismic activity offshore. Communities along the surrounding coasts of the Indian Ocean were devastated, and the tsunamis killed an estimated , people in countries, making it one of the deadliest natural disasters in recorded history. The direct results caused major disruptions to living conditions and commerce in coastal provinces of surrounded countries, including Aceh (Indonesia), Sri Lanka, Tamil Nadu (India) and Khao Lak (Thailand). Banda Aceh reported the largest number of deaths. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Economy_of_India","paragraph":" . % ( \/ f) (WB) . % ( ; modeled ILO est) "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_National_Army_trials","paragraph":" The Indian National Army trials (also known as the INA trials and the Red Fort trials) was the British Indian trial by court-martial of a number of officers of the Indian National Army (INA) between November and May , on various charges of treason, torture, murder and abetment to murder, during the Second World War. In total, approximately ten court-martials were held. The first of these was the joint court-martial of Colonel Prem Sahgal, Colonel Gurbaksh Singh Dhillon, and Major-General Shah Nawaz Khan. The three had been officers in the British Indian Army and were taken prisoner in Malaya, Singapore and Burma. They had, like a large number of other troops and officers of the British Indian Army, joined the Indian National Army and later fought in Burma alongside the Japanese military under the Azad Hind. These three came to be the only defendants in the trials who were charged with \"waging war against the King-Emperor\" (the Indian Army Act, did not provide for a separate charge for treason) as well as murder and abetment of murder. Those charged later only faced trial for torture and murder or abetment of murder. The trials covered arguments based on military law, constitutional law, international law, and politics. Historian Mithi Mukherjee has called the event of the trial \"a key moment in the elaboration of an anticolonial critique of international law in India.\" As it was an army trial, Lt. Col. Horilal Varma Bar At Law & the then-Prime Minister of the Rampur State, along with Tej Bahadur Sapru, served as the lawyers for the defendants. These trials attracted much publicity, and public sympathy for the defendants, particularly as India was in the final stages of the Indian independence movement. Outcry over the grounds of the trial, as well as a general emerging unease and unrest within the troops of the Raj, ultimately forced the then-Army Chief Field Marshal Claude Auchinleck to commute the sentences of the three defendants in the first trial. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Winter_Olympic_Games","paragraph":" The Winter Olympic Games (French: Jeux olympiques d'hiver)[nb ] is a major international multi-sport event held once every four years for sports practiced on snow and ice. The first Winter Olympic Games, the Winter Olympics, were held in Chamonix, France. The modern Olympic Games were inspired by the ancient Olympic Games, which were held in Olympia, Greece, from the th century BC to the th century AD. Baron Pierre de Coubertin founded the International Olympic Committee (IOC) in , leading to the first modern Summer Olympic Games in Athens, Greece in . The IOC is the governing body of the Olympic Movement, with the Olympic Charter defining its structure and authority. The original five Winter Olympic sports (broken into nine disciplines) were bobsleigh, curling, ice hockey, Nordic skiing (consisting of the disciplines military patrol,[nb ] cross-country skiing, Nordic combined, and ski jumping), and skating (consisting of the disciplines figure skating and speed skating).[nb ] The Games were held every four years from to , interrupted in and by World War II, and resumed in . Until , the Summer Olympic Games and the Winter Olympic Games were held in the same year, and in accordance with the decision by the IOC to place the Summer Olympic Games and the Winter Olympic Games on separate four-year cycles in alternating even-numbered years, the next Winter Olympic Games after were held in . "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Plains_Indians","paragraph":" Plains Indians or Indigenous peoples of the Great Plains and Canadian Prairies are the Native American tribes and First Nation band governments who have historically lived on the Interior Plains (the Great Plains and Canadian Prairies) of North America. While hunting-farming cultures have lived on the Great Plains for centuries prior to European contact, the region is known for the horse cultures that flourished from the th century through the late th century. Their historic nomadism and armed resistance to domination by the government and military forces of Canada and the United States have made the Plains Indian culture groups an archetype in literature and art for Native Americans everywhere. The Plains tribes are usually divided into two broad classifications which overlap to some degree. The first group became a fully nomadic horse culture during the th and th centuries, following the vast herds of buffalo, although some tribes occasionally engaged in agriculture. These include the Arapaho, Assiniboine, Blackfoot, Cheyenne, Comanche, Crow, Gros Ventre, Kiowa, Lakota, Lipan, Plains Apache (or Kiowa Apache), Plains Cree, Plains Ojibwe, Sarsi, Nakoda (Stoney), and Tonkawa. The second group were sedentary and semi-sedentary, and, in addition to hunting buffalo, they lived in villages, raised crops, and actively traded with other tribes. These include the Arikara, Hidatsa, Iowa, Kaw (or Kansa), Kitsai, Mandan, Missouria, Omaha, Osage, Otoe, Pawnee, Ponca, Quapaw, Wichita, and the Santee Dakota, Yanktonai and Yankton Dakota. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Partition_of_India","paragraph":" The partition of India was the division of British India[c] in into two independent Dominions: India and Pakistan. The Dominion of India is today the Republic of India, and the Dominion of Pakistan is the Islamic Republic of Pakistan and the People's Republic of Bangladesh. The partition involved the division of two provinces, Bengal and Punjab, based on district-wide non-Muslim or Muslim majorities. The partition also saw the division of the British Indian Army, the Royal Indian Navy, the Royal Indian Air Force, the Indian Civil Service, the railways, and the central treasury. The partition was outlined in the Indian Independence Act and resulted in the dissolution of the British Raj, i.e. Crown rule in India. The two self-governing independent Dominions of India and Pakistan legally came into existence at midnight on August . The partition displaced between and million people along religious lines, creating overwhelming refugee crises in the newly constituted dominions. There was large-scale violence, with estimates of the loss of life accompanying or preceding the partition disputed and varying between several hundred thousand and two million. [a] The violent nature of the partition created an atmosphere of hostility and suspicion between India and Pakistan that affects their relationship to this day. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Indian_Plate","paragraph":"The Indian Plate or India Plate is a minor tectonic plate straddling the Equator in the Eastern Hemisphere. Originally a part of the ancient continent of Gondwana, India broke away from the other fragments of Gondwana million years ago and began moving north. Once fused with the adjacent Australian Plate to form a single Indo-Australian Plate, recent studies suggest that India and Australia have been separate plates for at least million years and likely longer. The Indian Plate includes most of South Asia—i.e. the Indian subcontinent—and a portion of the basin under the Indian Ocean, including parts of South China and western Indonesia, and extending up to but not including Ladakh, Kohistan and Balochistan. Until roughly million years ago, the Indian Plate formed part of the supercontinent Gondwana together with modern Africa, Australia, Antarctica, and South America. Gondwana broke up as these continents drifted apart at different velocities, a process which led to the opening of the Indian Ocean. In the late Cretaceous, approximately million years ago and subsequent to the splitting off from Gondwana of conjoined Madagascar and India, the Indian Plate split from Madagascar. It began moving north, at about centimetres ( . in) per year, and is believed to have begun colliding with Asia as early as million years ago, in the Eocene epoch of the Cenozoic. However, some authors suggest the collision between India and Eurasia occurred much later, around million years ago. If the collision occurred between and Mya, the Indian Plate would have covered a distance of , to , kilometres ( , – , mi), moving more quickly than any other known plate. In , paleomagnetic data from the Greater Himalaya was used to propose two collisions to reconcile the discrepancy between the amount of crustal shortening in the Himalaya (~ , kilometres or miles) and the amount of convergence between India and Asia (~ , kilometres or , miles). These authors propose a continental fragment of northern Gondwana rifted from India, traveled northward, and initiated the \"soft collision\" between the Greater Himalaya and Asia at ~ Mya. This was followed by the \"hard collision\" between India and Asia occurred at ~ Mya. Subduction of the resulting ocean basin that formed between the Greater Himalayan fragment and India explains the apparent discrepancy between the crustal shortening estimates in the Himalaya and paleomagnetic data from India and Asia. However, the proposed ocean basin was not constrained by paleomagnetic data from the key time interval of ~ Mya to ~ Mya. New paleomagnetic results of this critical time interval from southern Tibet do not support this Greater Indian Ocean basin hypothesis and the associated dual collision model. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/News","paragraph":" News is information about current events. This may be provided through many different media: word of mouth, printing, postal systems, broadcasting, electronic communication, or through the testimony of observers and witnesses to events. News is sometimes called \"hard news\" to differentiate it from soft media. Common topics for news reports include war, government, politics, education, health, the environment, economy, business, fashion, and entertainment, as well as athletic events, quirky or unusual events. Government proclamations, concerning royal ceremonies, laws, taxes, public health, and criminals, have been dubbed news since ancient times. Technological and social developments, often driven by government communication and espionage networks, have increased the speed with which news can spread, as well as influenced its content. The genre of news as we know it today is closely associated with the newspaper. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Malliswari_(1951_film)","paragraph":" Malliswari is a Indian Telugu-language historical romance film produced and directed by B. N. Reddy under his banner Vauhini Studios. N. T. Rama Rao and P. Bhanumathi star as a couple – Nagaraju and Malliswari – who are separated by Malliswari's greedy mother. Malliswari is sent to the king's palace according to the custom of \"Rani Vasam\", a tradition during the Vijayanagara Empire wherein young women were fetched to the palace with an offering gold and jewellery to their parents. The rest of the film focuses on the consequences faced by Nagaraju when he, against all rules, surreptitiously enters the palace to meet Malliswari. Reddy wanted to make a film based on Krishnadevaraya's character ever since his visit to Hampi for the filming of his debut Vandemataram ( ). He employed Devulapalli Krishnasastri to write the film's script and took inspiration from Buchibabu's play \"Rayalavari Karunakruthyamu\" and Devan Sharar's short story \"The Emperor and the Slave Girl\". He also incorporated into the script a few incidents from his childhood for the pranks between Nagaraju and Malliswari. S. Rajeswara Rao composed the film's music, Adi M. Irani and B. N. Konda Reddy provided the cinematography, H. R. Narayana and Vasu edited the film, and A. K. Shekhar was the film's production designer. "},{"url":"https:\/\/en.wikipedia.org\/wiki\/Historiography","paragraph":"Historiography is the study of the methods of historians in developing history as an academic discipline, and by extension is any body of historical work on a particular subject. The historiography of a specific topic covers how historians have studied that topic using particular sources, techniques, and theoretical approaches. Scholars discuss historiography by topic—such as the historiography of the United Kingdom, that of WWII, the British Empire, early Islam, and China—and different approaches and genres, such as political history and social history. Beginning in the nineteenth century, with the development of academic history, there developed a body of historiographic literature. The extent to which historians are influenced by their own groups and loyalties—such as to their nation state—remains a debated question. In the ancient world, chronological annals were produced in civilizations such as ancient Egypt and Mesopotamia. However, the discipline of historiography was first established in the th century BC with the Histories of Herodotus, the founder of historiography. The Roman statesman Cato the Elder produced the first history in Latin, the Origines, in the nd century BC. His near contemporaries Sima Tan and Sima Qian in the Han Empire of China established Chinese historiography with the compiling of the Shiji (Records of the Grand Historian). During the Middle Ages, medieval historiography included the works of chronicles in medieval Europe, Islamic histories by Muslim historians, and the Korean and Japanese historical writings based on the existing Chinese model. During the th-century Age of Enlightenment, historiography in the Western world was shaped and developed by figures such as Voltaire, David Hume, and Edward Gibbon, who among others set the foundations for the modern discipline. The research interests of historians change over time, and there has been a shift away from traditional diplomatic, economic, and political history toward newer approaches, especially social and cultural studies. From to the proportion of professors of history in American universities identifying with social history increased from to percent, while the proportion of political historians decreased from to percent. In , of , faculty in the departments of history at British universities, , ( percent) identified themselves with social history and , ( percent) identified themselves with political history. Since the s there has been a special interest in the memories and commemoration of past events—the histories as remembered and presented for popular celebration. "}]